Autodesk.Revit.DB.MultiReferenceAnnotationType.IsAllowedDimensionStyle(Autodesk.Revit.DB.ElementId)
Checks if the dimension style can be used with multi-reference annotations.
Remarks:
Only linear dimension styles are allowed.
dimensionStyleId:
The dimension style to check.
Returns:
True if the dimension style can be used by multi-reference annotations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.IsAllowedReferenceCategory(Autodesk.Revit.DB.ElementId)
Checks if the reference category can be used with multi-reference annotations.
Remarks:
Only Structural Rebar is allowed.
referenceCategoryId:
The reference category to check.
Returns:
True when the reference category can be used by multi-reference annotations.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.IsAllowedTagCategory(Autodesk.Revit.DB.ElementId)
Returns true if tag types belonging to this category can be used with multi-reference annotation types.
Remarks:
Only Structural Rebar Tags are allowed.
tagCategoryId:
The tag category to test.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.IsAllowedTagType(Autodesk.Revit.DB.ElementId)
Checks if the tag type can be assigned to this multi-reference annotation type.
Remarks:
Only tag types which exclusively tag elements from the multi-reference annotation's reference category can be used.
tagTypeId:
The tag type to test.
Returns:
True if the tag type exclusively tags elements from the multi-reference annotation's reference category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.GetAllowedTagCategory
Returns the category ID for the tag types which can be used by this multi-reference annotation type.
Remarks:
The allowed tag category is determined by the reference category of this multi-reference annotation type.
Returns:
The allowed tag category ID.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.CreateDefault(Autodesk.Revit.DB.Document)
Creates the first MultiReferenceAnnotationType element and adds it to the document.
Remarks:
If there is no existing MultiReferenceAnnotationType a new one will be created, otherwise an exception will be thrown.
Use Autodesk.Revit.DB.ElementType.Duplicate(System.String) to create all further MultiReferenceAnnotationTypes.
The default MultiReferenceAnnotationType will use the document's current default
linear dimension style and will have Structural Rebar as its reference category.
No tag type will be set for the new MultiReferenceAnnotationType.
document:
The document to be modified.
Returns:
The new MultiReferenceAnnotationType element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
There are existing MultiReferenceAnnotationTypes in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.DimensionStyleId
The dimension style which will be used by the child dimension of the multi-reference annotation.
Only linear dimension styles can be used.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The dimension style is not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.ShowDimensionText
Controls if text from the multi-reference annotation's dimension will be shown.
When false, all dimension text including segment values will be hidden.
When true, all dimension text will be shown.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.GroupTagHeads
Controls if parameter values for the annotation's references will be reported in one grouped tag head
or if every reference will get its own tag head.
When false, each reference will get one tag head.
When true, if all references report the same parameter values, a single tag head will be created.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.TagTypeId
The tag type which will be used by the child tag the multi-reference annotation.
The tag type must be able to tag elements belonging to the multi-reference annotation's reference category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The tag type is not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType.ReferenceCategoryId
The category of elements to which this annotation applies.
Remarks:
The TagTypeId will be cleared because the user must set a new tag type of an appropriate category.
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationType
The type for MultiReferenceAnnotation.
Remarks:
Multi-reference annotations can be used to label and dimension Rebar elements, and are labeled in the user interface as "Multi-rebar annotations".
The type specifies the tag and dimension types to be used in the multi-reference annotation, as well as associated display settings.
Since:
2014